app/controllers/info_forms_controller.rb

SELECT "info_forms".* FROM "info_forms"
---
  def index
    @info_forms = InfoForm.all

SELECT "info_forms".* FROM "info_forms" WHERE "info_forms"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @info_form = InfoForm.find(params[:id])

SELECT "info_forms".* FROM "info_forms" WHERE "info_forms"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @info_form = InfoForm.find(params[:id])

INSERT INTO "info_forms" ("budget", "budgetrange", "comments", "company", "contact", "created_at", "currentsys", "description", "email", "hostingpref", "implement", "industry", "location", "other1", "preferredbudget", "preferredsys", "updated_at", "usercount") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @info_form = InfoForm.new(params[:info_form])

    respond_to do |format|
      if @info_form.save

SELECT "info_forms".* FROM "info_forms" WHERE "info_forms"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "info_forms" WHERE "info_forms"."id" = ?  [["id", 6]]
---
  def destroy
    @info_form = InfoForm.find(params[:id])
    @info_form.destroy